asidjwiaijd/Magnetic_levitation/CH32V203G6U/User/board.h
/********************************** (C) COPYRIGHT *******************************
 * File Name          : board.h
 * Description        : 磁悬浮底座板级定义 —— 引脚映射、控制参数、标定常数
 *                      引脚名均取自原理图 U3 (CH32V203G6U6, QFN-28) 符号
 *******************************************************************************/
#ifndef __BOARD_H
#define __BOARD_H

#include "ch32v20x.h"

/* ======================= 引脚映射 (原理图 U3) =======================
 *  脚号  网络      端口        用途
 *   7   IN2_C     PA1        C 路方向脚
 *   8   IN1_C     PA2        C 路 PWM (TIM2_CH3)
 *   9   IN2_A     PA3        A 路 PWM (TIM2_CH4)
 *  10   IN1_A     PA4        A 路方向脚   (无定时器通道)
 *  11   IN2_B     PA5        B 路方向脚   (无定时器通道)
 *  12   IN1_B     PA6        B 路 PWM (TIM3_CH1)
 *  13   IN2_D     PA7        D 路方向脚
 *  14   IN1_D     PB0        D 路 PWM (TIM3_CH3)
 *  18   TX        PA9        USART1 -> 裁判系统 (H6)
 *  19   RX        PA10       USART1 <- 裁判系统 (H6)
 *  25   DIN       PB4        WS2812 数据 (开漏, R9 910R 上拉)
 *  27   SCL       PB6        I2C1 -> TMAG5273
 *  28   SDA       PB7        I2C1 -> TMAG5273
 *
 *  PA4/PA5 没有任何定时器通道, 所以四路全桥统一采用
 *  「一脚 PWM + 一脚 GPIO 方向」的符号-幅值驱动, 详见 coil.c
 * =================================================================== */

/* ======================= 飞线改版开关 =======================
 * 1 = 已做改版, 0 = 原始板。改版内容(两根飞线):
 *      IN1_A: U3.10(PA4, 无定时器)  ->  U3.6 (PA0 = TIM2_CH1)
 *      IN2_B: U3.11(PA5, 无定时器)  ->  U3.15(PB1 = TIM3_CH4)
 *
 * 为什么必须改: 原始板上 A、B 两路的其中一个输入脚没有任何定时器通道, 只能
 * 当静态方向电平, 于是必有一个方向走快衰减。快衰减在小占空比下电流断续,
 * 实测比另一侧弱 31~403 倍, 等于这两路是单向执行器。
 * 改完之后四路的 IN1/IN2 都落在同一个定时器上:
 *      TIM2: CH1=IN1_A  CH2=IN2_C  CH3=IN1_C  CH4=IN2_A
 *      TIM3: CH1=IN1_B  CH2=IN2_D  CH3=IN1_D  CH4=IN2_B
 * 8 个脚、8 个通道、2 个定时器正好占满, 且每路两个通道同源同步。
 * ============================================================ */
#define BOARD_REWORK_DUAL_PWM   1

/* ---- 线圈通道编号 ---- */
#define COIL_A              0
#define COIL_B              1
#define COIL_C              2
#define COIL_D              3
#define COIL_NUM            4

/* ---- PWM ----
 * 20 kHz: 高于音频, 且远低于 DRV8870 的 100 kHz 上限。
 * ARR = 96MHz / 20kHz - 1 = 4799, 即 4800 级分辨率。 */
#define COIL_PWM_FREQ_HZ    20000
#define COIL_PWM_ARR        (96000000 / COIL_PWM_FREQ_HZ - 1)

/* 线圈指令满量程: Coil_Set() 接受 -COIL_CMD_MAX .. +COIL_CMD_MAX */
#define COIL_CMD_MAX        1000

/* 软件占空比上限。硬件限流由 200mΩ 采样电阻 + VREF=3.3V 决定 (≈1.65A),
 * 这里再留一层软件余量, 兼顾 12V/5A 的总电源限制与 70℃ 温升要求。
 *
 * 850 -> 600 的依据是实测扫描 (host/sweep.py, A 路, 空台面):
 *   指令   200    400    600    800
 *   斜率  1085   1046    993    837   counts/1000指令
 *   残差    55     58     30    126   counts (串扰补偿后剩下的)
 * 600 以内斜率还保持 95%, 到 800 掉到 80% —— 而串扰补偿是一条过 0 和 ±400 的
 * 直线, 执行器一旦压缩, 补偿就按线性外推去扣, 多扣的部分在读数上跟横向位移
 * 长得一模一样(800 档的残差 126 counts ≈ 5.5mm 假位移, 赛规容差才 ±10mm)。
 * 砍到 600 损失的是本来就不成比例的那部分推力, 换回补偿模型继续成立。 */
#define COIL_CMD_LIMIT      600

/* 单路电流方向定义: +1 表示「正指令 = IN1 侧为高」。
 * 实际磁场方向还取决于线圈绕向与焊接方向 —— 调试时若某路推力反了,
 * 把对应项取反即可, 不要去改 coil.c。 */
#if BOARD_REWORK_DUAL_PWM
/* 四路的 ch_pwm 统一是 IN1 侧, 但实测四个线圈的绕向/接线方向与「IN1 为高 =
 * 斥力」的假设整体相反(四路一致), 所以四个都取 -1。
 * 判据: 开环给正指令时矿石必须被推开; 若被吸下去就把对应项取反。 */
#define COIL_SIGN_INIT      { -1, -1, -1, -1 }
#else
/* 原始板上 A 路的 PWM 落在 IN2_A 上(其余三路都在 IN1_x), 故 A 取 -1 */
#define COIL_SIGN_INIT      { -1, +1, +1, +1 }
#endif

/* ---- 线圈几何 / 混合矩阵 ----
 * 实际摆放 (传感器坐标系, X 朝上 Y 朝右), 四个线圈落在象限上而不是轴上:
 *
 *                    X
 *                    ^
 *           A        |        D
 *                    |
 *        ------------+------------> Y
 *                    |
 *           C        |        B
 *
 * 位置向量:  A(+x,-y)  B(-x,+y)  C(-x,-y)  D(+x,+y)
 * 数组顺序是 A,B,C,D。
 *
 * 象限布局比轴上布局好: 四路都同时参与 X 和 Y 两个轴, 横向出力更大也更对称。
 * 投影系数本应是 1/√2, 这里直接用 ±1, 差的那个常数被 KP_XY 吸收掉。
 *
 * 两张表各自的和都是 0, 所以横向纠偏不会漏出竖直分量 —— 高度环和横向环解耦。*/
#define COIL_MIX_X_INIT     { +1, -1, -1, +1 }
#define COIL_MIX_Y_INIT     { -1, +1, -1, +1 }

/* 横向反馈的总极性。推理链:
 *   1) 高度环要求「正指令 = 更大升力」(err>0 表示偏低, u_z=+KP*err), 这一条由
 *      COIL_SIGN_INIT 保证;
 *   2) 某一路升力变大 = 对矿石的斥力变大, 力的方向沿「线圈 -> 矿石」, 因此
 *      也会把矿石朝远离该线圈的方向推;
 *   3) 矿石朝 +X 偏移时 Bx>0 (轴上偶极子 Bx = 3k·h·x/r⁵, S 极朝下 -> k>0);
 *   4) 要把它推回 -X, 就该加大 +X 侧的 A、D —— 而 mix_x[A]=mix_x[D]=+1,
 *      所以需要 u_x > 0。
 *   => u_x 与 bx 同号, 取 +1。
 *
 * 【实测结论: -1】上板验证的结果与上面推导相反, 原因出在第 3 步 —— 传感器的
 * +Z 实际朝向与假设相反。这一点被上位机独立印证: 位置估计 x = (2/3)·h·Bx/Bz
 * 里 Bz 在分母上, Z 轴反号等价于 X、Y 同时反号, 而 tuner.py 的「位置取反」确实
 * 需要打开。两处观测独立, 结论一致。
 *
 * 所以这两个符号是同一个物理量的两个出口, 要改一起改:
 *      传感器 +Z 朝向翻转  <=>  LATERAL_SIGN 翻转  <=>  tuner.py 位置取反 翻转
 * 只改一个会得到"图看着对但控制反着推"这种最难查的组合。
 *
 * 重新验证的方法: 手持矿石朝某一路(比如 C)平移, 那一路的指令应该变大 —— 靠近
 * 谁就让谁加大斥力推回去。反了就翻这里, 不要去动混合矩阵。 */
#define LATERAL_SIGN        (-1)

/* ---- 控制环 ---- */
#define CONTROL_HZ          1000        /* TIM4 中断频率 */
#define REPORT_HZ           50          /* 上报裁判系统 (要求 >10Hz) */
#define LED_HZ              50          /* WS2812 刷新 */

/* ---- WS2812 ---- */
#define WS2812_LED_NUM      4
/* LED 链序到线圈的对应关系。数组下标就是菊花链位置(0 = 链上第一颗 LED1)。
 * 实际布局: LED1=A, LED2=C, LED3=B, LED4=D。
 *
 * 对照 COIL_MIX 里的象限图, 链序 A->C->B->D 正好是
 * 左上 -> 左下 -> 右下 -> 右上, 即绕底座转一圈, 所以标定时的流水灯效在
 * 板子上看就是真的在转圈。 */
#define LED_TO_COIL_INIT    { COIL_A, COIL_C, COIL_B, COIL_D }

/* ---- 霍尔传感器 ----
 * 实装型号 TMAG5273B2QDBVR: B 版 -> 7 位地址 0x22; 版本 2 -> 量程 ±133/±266 mT
 * (±266mT 就是这颗的上限, 整个 TMAG5273 系列没有更大的) */
#define TMAG_I2C_ADDR       0x22

/* 量程按轴分别设置 —— SENSOR_CONFIG_2 的 bit1 管 X/Y, bit0 管 Z, 互相独立。
 *      0 = ±133 mT, 4.06 uT/LSB
 *      1 = ±266 mT, 8.12 uT/LSB
 *
 * 默认「Z 高 / XY 低」, 是按「四个电磁铁外圈套环形永磁体」这个拓扑选的:
 *   Z 扛着环形永磁体的大直流偏置, 一旦饱和读数被削平, 控制器拿着削平的数据
 *     照算, 表现是「参数怎么调都不对」。宁可牺牲一半分辨率 —— 最弱的 5cm 处
 *     仍有约 59 LSB, 离 ±0.5cm 的测量要求还差两个数量级。
 *   X/Y 在环的几何中心上, 永磁体的贡献按对称性名义为零, 留在低量程换分辨率。
 *     横向是唯一不稳定的轴, 分辨率花在这里最值(0.1mm 约合 2.5 LSB)。
 *
 * 上电若红灯快闪 = 饱和(见 levitation.c 的饱和检测), 再把对应轴改成 1。 */
#define TMAG_XY_HIGH_RANGE  0
#define TMAG_Z_HIGH_RANGE   1

/* ---- 悬浮高度标定 ----
 * 轴线上偶极子磁场 B = K / r^3。K 由一次已知高度的标定得到:
 *      K = B_cal * (h_cal + H_SENSOR_OFFSET)^3
 * 高度单位统一用 0.1mm (即 mm*10), 磁场单位用 0.01mT (即 mT*100),
 * 与 TMAG5273 驱动的输出标度一致。 */
/* 传感器面到底座台面的距离 (0.1mm)。注意它的两个身份:
 *   1) 上报给裁判系统的高度 = r - H_SENSOR_OFFSET, 填错就整体偏一个常数;
 *   2) lat_norm 用的 r 也是 h + H_SENSOR_OFFSET, 填错横向增益基准就跟着偏。
 *
 * 传感器贴在 PCB 上, 而线圈高 12mm、环高 10mm —— 台面是线圈顶面, 所以要减掉的
 * 是线圈高度, 不是原来那个 3mm。实测「不受力浮高 45mm(到传感器)」对应台面上方
 * 33mm, 落在赛规 15~50mm 的中段。
 *
 * KZ_DEF 不受影响: 它定义在 r 上 (kz = Bz * r^3), 而标定时量的就是到传感器的
 * 距离, 所以改这里不需要重标 kz。但目标高度要按新口径重设(点「目标←当前高度」)。
 *
 * 【待核实】12mm 取自线圈厚度, 实际台面若另有外壳要用卡尺量过再改。 */
#define H_SENSOR_OFFSET     120         /* 传感器面到底座台面的距离, 0.1mm */
#define H_MIN_01MM          150         /* 1.5cm 下限 */
#define H_MAX_01MM          500         /* 5.0cm 上限 */
/* 上电默认目标 = 实测的被动平衡点 (台面上方 33mm)。在平衡点上工作代价最低:
 *   - lat_norm = (r/r_nom)^4 恰为 1, 横向增益不被放大(这是调横向的前提);
 *   - 高度环几乎不用出力, 线圈电流小 -> 温度低(赛规上限 70℃);
 *   - 赛规区间 15~50mm, 上下各留 1.7cm 余量, 满足 ±1cm 波动要求。 */
#define H_DEFAULT_01MM      330         /* 上电默认目标 3.3cm = 被动平衡点 */

/* ---- 被动平衡点与高度前馈 ----
 * 吸力式(见 levitation.c 文件头): 平衡点在环的轴向场峰【下方】, 下沉 -> dB/dz
 * 变大 -> 吸力变大 -> 托回去。所以竖直是被动稳定的, 线圈只需要出一个准静态偏置
 * 把平衡点从 H0_PASSIVE 挪到目标高度。
 *
 * 【实测】不受力时矿石停在传感器上方 45mm, 即台面上方 33mm。单独测自由环形磁铁
 * (无线圈无铁芯)是 41mm(量到矿石端面, 磁中心约低 5mm), 两者一致 —— 说明升力
 * 基本全部来自环, 线圈的铁芯没有显著改变平衡点。
 *
 * KFF_Z: 每偏离被动平衡点 0.1mm 所需的线圈指令。测法: 在若干个高度上记录稳态的
 *        积分项输出, 对 (h - H0) 做线性拟合取斜率。
 * 默认 0 = 前馈关闭, 全靠积分项兜底。实测之前不要瞎填 —— 给错方向会把环路推开。
 *
 * 【可调范围很窄】被动稳定窗口只有 8.5~41.5mm(磁中心, 环顶起算), 越过场峰矿石
 * 就掉, 低于梯度峰会一路砸下来。目标高度别往窗口边缘设。 */
#define H0_PASSIVE_01MM     330         /* 实测: 台面上方 33mm */
#define KFF_Z               0.0f


/* ---- 矿石在场/贴底判据 ----
 * 这两个阈值一律由高度反推, 不要直接写磁场数值。踩过的坑: 原来是硬编码的绝对
 * 值(30 / 24000), kz 一重标就全部失效 —— kz 从 2.91e10 改到 6.30e10 之后,
 * 「贴底」阈值对应 1.08cm 而饱和判据对应 1.05cm, 两者只差 0.3mm, 噪声一抖就是
 * 饱和先触发, 于是走进 FAULT 而不是「贴底」那条正常分支。
 * 按高度定义之后, 换磁铁重标 kz 这两个阈值会自己跟着走。 */
#define BZ_AT_H(h01)    ((float)KZ_DEF / ((float)((h01) + H_SENSOR_OFFSET) *  \
                                          (float)((h01) + H_SENSOR_OFFSET) *  \
                                          (float)((h01) + H_SENSOR_OFFSET)))

/* 超过这个高度认为矿石被取走/飞脱。赛规上限 5.0cm, 这里留到 7.5cm。 */
#define ORE_FAR_LIMIT_01MM  750
#define ORE_PRESENT_MIN_BZ  BZ_AT_H(ORE_FAR_LIMIT_01MM)

/* 低于这个高度认为矿石已经贴到底座上。两边都要留够:
 *   上: 必须低于赛规下限 1.5cm, 否则正常悬浮会被误判成贴底;
 *   下: 必须明显高于饱和点, 否则读数先被削平, 这个判据永远触发不了。
 * 按 KZ_DEF=6.30e10 / Z 高量程: 1.2cm 处 Bz 约 18679, 而 95% 满量程的饱和判据
 * 在 25270(约 1.05cm) —— 中间隔了 35%, 够了。
 *
 * 注意 Z 轴必须用高量程: 1.5cm 处已经 108mT, 低量程满刻度才 133mT。 */
#define ORE_NEAR_LIMIT_01MM 120
#define ORE_TOO_CLOSE_BZ    BZ_AT_H(ORE_NEAR_LIMIT_01MM)

/* ---- 空载重新归零 ----
 * 环形永磁体在传感器处产生一个大的直流偏置, 矿石信号是叠在它上面的小量。
 * NdFeB 温度系数约 -0.12%/℃, 偏置 50mT 时温升 10℃ 就漂移约 6 个单位, 而 5cm
 * 处的矿石信号只有约 48 个单位 —— 开机标一次不够, 必须在空载时持续跟踪零点。
 *
 * 时间常数取 2s: 足够跟上温漂, 又远慢于放矿石的动作, 不会把矿石吞进零点。 */
#define REZERO_ALPHA        (1.0f / 2000.0f)
/* 只有磁场明显低于「矿石在场」阈值时才归零, 留一档余量防止慢慢靠近的矿石被吞掉 */
#define REZERO_GUARD_BZ     (ORE_PRESENT_MIN_BZ / 2)

/* ---- 安全 ---- */
#define SENSOR_FAIL_LIMIT   10          /* 连续读失败多少次后切断输出 */
#define TEMP_LIMIT_C        65          /* 传感器温度上限 (要求整机 <70℃) */

/* ======================= 控制增益 (全部可在线调) =======================
 * 这些只是上电默认值, 运行时可以被上位机改写 (见 tuning.h 的 tune_t)。
 * 量纲: 输入 0.01mT, 输出 COIL_CMD (±1000)。
 *
 * 分工: 横向是快环(唯一不稳定的轴), 高度是慢环(被动稳定)。所以横向的比例和
 * 微分都比高度大一个量级, 高度靠前馈 + 积分把稳态误差吃掉。
 *
 * >>> 当前是【调试状态】, 不是比赛状态 <<<
 * 参数没有 Flash 存储层, 每次烧录/断电都退回这里的默认值 —— 调试期间反复用
 * 上位机敲一遍太费事, 所以默认值直接设成"只开横向环"的整定配置:
 *      高度环四项(kp_z/ki_z/kd_z/kff_z)全为 0, 竖直方向纯靠永磁体被动稳定;
 *      横向环单独整定, 稳住之后再按 CLAUDE.md 的顺序把高度环加回来。
 * 整定完成后必须把高度环的默认值填回去, 否则上电就是一台不控高度的机器。 */

/* 高度: 慢环。【调试期全部置 0】整定好的起步值记在注释里, 别丢了:
 *      KP_Z 0.40 / KI_Z 8.00 / KD_Z 0.010
 * KI_Z 不能太小: 0.6 那种量级要十几秒才攒满积分限幅, 而测试只有 10s, 等于没积分。*/
#define KP_Z_DEF        0.0f
#define KI_Z_DEF        0.0f
#define KD_Z_DEF        0.0f
#define I_LIMIT_Z_DEF   400.0f      /* 升力来自永磁体, 悬停偏置小, 400 足够 */

/* 横向: 快环。
 *
 * 【别拿早期实验的数字外推】"kp_xy=4 有收敛趋势"那次是在实测 KZ 之前, 按新标度
 * 重算, 矿石当时实际浮在 5cm 而不是以为的 3cm。横向测量灵敏度 = 1.5*Bz/r:
 *      5.0cm -> Bz 195 -> 0.55 counts/0.1mm
 *      3.0cm -> Bz 810 -> 3.68 counts/0.1mm     差 6.7 倍
 * 而 lat_norm 以目标高度为基准, 目标 3cm 时系数为 1, 所以同一个 kp_xy 在 3cm
 * 处的环路增益是当初的 6.7 倍 —— kp_xy=4 的等效值只有 0.6。线圈对矿石的作用力
 * 在 3cm 处也更强, 实际可用上限还要更低。
 *
 * 所以默认给 0.4 做起步, 往上 x1.5 逐档加。顶到不稳时四路会同时满限幅,
 * SAT_STALL_TICKS 会在 2s 内断电进 FAULT, 点「清除故障」即可。 */
/* 【实测】kp_xy = 3 是矿石开始有收敛趋势的量级, 以此为起点。
 * 之前给的 0.4 是拿一个没有依据的环路增益推的, 偏小近一个数量级。 */
#define KP_XY_DEF       3.00f

/* kd 不要独立去试 —— kd/kp 是个时间常数, 取值由物理定死, 与所有未知增益无关。
 *      u = kp*bx + kd*dbx/dt = kp*[ bx + (kd/kp)*dbx/dt ]
 * 括号里就是把 bx 往前外推 (kd/kp) 秒。闭环特征方程 s^2 + G*kd*s + (G*kp - a^2),
 * 取 G*kp = 2a^2 与 zeta = 0.7 可得 kd/kp = 0.7/a, 其中 G 被约掉。
 * a 是横向不稳定极点, 由竖直弹跳频率给出(Earnshaw: k_x = -k_z/2, 这条与场源
 * 形状、吸力还是斥力都无关):
 *      a = 2*pi*f_z/sqrt(2) = 4.44*f_z
 *
 * 【实测 f_z = 7Hz】-> k_z = 58 N/m, a = 31.1 rad/s (4.95Hz), 发散时间常数 32ms。
 * (模型预测 7.35Hz, 实测 7Hz —— 吸力式的场型模型由此得到确认。)
 *
 * 更精确的定法还需要环路增益 G, 它也能测: kd=0 时纯比例在不稳定极点上是等幅
 * 振荡, s^2 + (G*kp - a^2) = 0 -> w_osc^2 = G*kp - a^2; 而 zeta=0.7 要求
 * G*kd = 1.4*w_osc。两式相除 G 被约掉:
 *      kd = kp * 1.4*w_osc / (w_osc^2 + a^2)
 * 上位机会用实测的 f_z 与横向振荡频率直接把这个数算出来显示。
 * 好在它对 w_osc 不敏感: 振荡 5~20Hz 对应 kd/kp = 0.023~0.011, 取 0.021 够用。
 *
 * 所以 kp=3 配 kd=0.064。【注意这个比值】之前默认的 0.0086 是按 kp=0.4 算的,
 * 直接配 kp=3 的话比值只有 0.0029, 阻尼少了 7 倍 —— "加 kd 没效果"多半是这么来的。
 *
 * 改 kp 时 kd 按 sqrt 跟着走(zeta 恒定要求 kd 正比于 sqrt(kp)): kp 翻倍 kd 乘 1.4。*/
#define KD_XY_DEF       0.064f

/* 微分项低通 (一阶), 0..1, 越小越平滑。两个环路用不同强度:
 *   高度是慢环, 滤狠一点换低噪声      -> 0.15, 时间常数约 6.7ms (~24Hz)
 *   横向是快环, 滤太狠会在穿越频率处引入相位滞后, 反而把不稳定轴滤发散
 *                                     -> 0.40, 时间常数约 2.5ms (~64Hz) */
#define D_LPF_Z_DEF     0.15f
#define D_LPF_XY_DEF    0.40f

/* 每拍输出变化上限, 抑制换向冲击。横向是快环, 不能卡太死。 */
#define SLEW_LIMIT_DEF  120.0f

/* 串扰补偿的一阶滞后系数 —— 见 levitation.c 里 cmd_lag 的说明。
 * 线圈实测 L=4.1mH, R=4.2Ω, 电气时间常数 tau = L/R = 0.98ms, 与 1ms 的控制
 * 周期同量级。离散化: alpha = 1 - exp(-Ts/tau) = 1 - exp(-1.02) = 0.64。
 *
 * 实际回路电阻还要加上 DRV8870 两个 MOS 的导通电阻与走线(约 0.5Ω), 所以真实
 * tau 略小于 0.98ms、alpha 略大于 0.64。做成可调参数就是为了在板上微调:
 * 调过头(alpha 偏大)欠补偿, 调不够(alpha 偏小)过补偿, 两边都表现为横向环在
 * 某个 kp_xy 上开始抖 —— 扫一遍取抖动阈值最高的那个值。
 *      1.0 = 不滞后(与加这个补偿之前完全一致), 越小滞后越重 */
#define CT_LAG_DEF      0.64f

/* 横向环的高度归一化钳位 —— 见 levitation.c 里 lat_norm 的推导。
 * 归一化系数是 (h/h_nom)^4, 四次方放大一切误差: kz 没标准、矿石飞到量程边缘、
 * 或者 Bz 被别的东西干扰时, h 读数一偏, 系数立刻失控。钳住之后最坏情况只是
 * 退回"没有归一化"的状态, 而不是把横向增益直接放大几十倍。 */
#define LAT_NORM_MIN    0.25f
#define LAT_NORM_MAX    4.0f

/* 归一化系数自己的低通。它是 (h/h_nom)^4, 四次方把 Bz 的噪声放大 4 倍, 而这个
 * 系数直接乘在横向输出上 —— 不滤就是把噪声灌进那个增益最高的环。h 本身是慢量
 * (刚体模态才 5Hz), 滤到 20ms 时间常数完全不影响物理, 只砍噪声。 */
#define LAT_NORM_LPF    0.05f

/* ---- 横向读数低通 (移植自参考工程 magnetic-levitation) ----
 * 参考工程在【误差之前】先对三轴读数做一阶低通, 再拿滤波值算 P 和 D:
 *      adc = 0.8*adc + 0.2*value   @2kHz
 * 折算到 1kHz: 极点 0.8^2 = 0.64, 即 alpha = 0.36, 时间常数约 2.2ms (~71Hz)。
 * 我们原来只滤微分不滤比例, 比例项因此直接吃 LSB 抖动。在 71Hz 上滤对 5Hz 的
 * 环路几乎不带相位代价(atan(5/71) = 4 度), 换来的是比例通道干净得多。
 *      1.0 = 不滤波(与移植之前完全一致) */
#define XY_LPF_DEF      0.36f

/* ---- 设定点自整定 (移植自参考工程, 那边叫 Ex_adjust/Ey_adjust) ----
 *
 * 【这是整个移植里最值钱的一条】积分项不加在输出上, 而是慢慢挪【设定点】,
 * 被积量是【线圈出力】而不是位置误差:
 *      trim += trim_k * u_x
 *
 * 收敛条件是 u_x = 0, 即"线圈不用出力"。而横向被动力 F = k*x 只在 x=0 处为零,
 * 所以稳态必然停在【真正的几何中心】—— 传感器的一切直流偏置(倾斜漏的 Bz、
 * 串扰直流分量、装配偏心、永磁体温漂)全被 trim 吸收进设定点, 不占位置预算。
 *
 * 顺带的好处: 稳态输出归零 => 稳态串扰也归零, 线圈常驻在 0 附近而不是某个
 * 几百的偏置上, 离 COIL_CMD_LIMIT 和限流拐点都更远。
 *
 * 注意符号: trim 的直接效应看着是正反馈(trim 变大 -> u_x 变大), 环是通过
 * "矿石被推动、读数跟着设定点走"闭合的。参考工程实物验证过这个方向。
 * 快环若本来就没稳住, trim 会一路跑到钳位 —— 所以下面的门限就是唯一的保险。
 *
 * 时间常数: trim_k=1e-4 配 kp_xy=3 时, d(trim)/dt = 1e-4*3*e*1000 = 0.3*e /s,
 * 即 tau 约 3.3s, 与 5Hz 的横向动态差三个数量级, 不互相干扰。
 *      trim_k = 0 完全关闭(与移植之前一致) */
#define TRIM_K_DEF      1.0e-4f

/* trim 的钳位, 同时兼作积分门限: |bx - trim| 超过它就停止积分。
 * 参考工程是两个独立值(门限 50 / 钳位 200), 但积分本身慢到 3s 量级, 暂态卷绕
 * 可以忽略(200ms 的暂态只能推动 trim 约 12 counts), 合成一个够用。
 * 400 counts 在 r=45mm 处约合 17mm, 足够吃下 10 度倾斜 + 串扰残差。 */
#define TRIM_LIM_DEF    400.0f

/* 高度常数 —— 【实测值】, 由 Levitation_CalibrateHeightPoint 在已知高度反算。
 * 量纲: KZ = B(0.01mT) * (r in 0.1mm)^3, 其中 r = h + H_SENSOR_OFFSET。
 *
 * 实测标度:
 *      1.0cm -> Bz 25900 (259mT)   <- 已经贴着 Z 高量程的满刻度
 *      1.5cm -> Bz 10809 (108mT)
 *      3.0cm -> Bz  1754 (17.5mT)
 *      5.0cm -> Bz   423 ( 4.2mT)
 *
 * 由此确定 Z 轴必须用高量程(TMAG_Z_HIGH_RANGE=1): 赛规下限 1.5cm 处就有 108mT,
 * 低量程满刻度才 133mT, 根本不够用。高量程下 1.05cm 以下才饱和。
 * 分辨率不是问题: dBz/dh = 3*Bz/r, 3cm 处约 16 counts/0.1mm, 1 个 LSB 合
 * 0.006mm, 比 ±0.5cm 的要求富裕三个数量级。
 *
 * 【偶极子近似的有效性要当心】按 Br=1.18T 反推磁矩 3.15 A·m2, 体积约 3.4cm3,
 * 也就是 Ø25x7 或 Ø30x5 这个量级。而 1.5cm 高度处 r 只有 18mm, 比磁铁直径还小
 * —— B ∝ 1/r^3 在那里根本不成立。所以低高度段的高度读数会系统性偏, 必须在
 * 2.0cm 和 1.5cm 各复核一次, 超出 ±0.5cm 就得换成多点拟合或查表。
 *
 * 换磁铁必须重标。参数没有 Flash 存储层, 上位机标出来的值要手工填回这里。 */
#define KZ_DEF          (6.30421e10f)

#endif /* __BOARD_H */
